In [31]:
%matplotlib inline
# Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
# Load in csv
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [32]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)

# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
#ride_data_df.head(10)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [33]:
# Get the columns and the rows that are not null.
# could use this city_data_df.isnull().sum() but the botom one works too 
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [34]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [35]:
# Get the unique values of the type of city.
city_data_df["type"].unique()
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")
sum(city_data_df["type"]=="Suburban")
sum(city_data_df["type"]=="Rural")

18

In [36]:
# Get the columns and the rows that are not null.
#ride_data_df.isnull().sum()
ride_data_df.count()
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [54]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="outer", on=["city", "city"])

# Display the DataFrame
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,Lake Jonathanshire,4/7/2019 20:51,31.25,4.441250e+12,5,Urban
2,Lake Jonathanshire,3/9/2019 23:45,19.89,2.389500e+12,5,Urban
3,Lake Jonathanshire,4/7/2019 18:09,24.28,7.796810e+12,5,Urban
4,Lake Jonathanshire,1/2/2019 14:14,13.89,4.242550e+11,5,Urban
...,...,...,...,...,...,...
2370,West Heather,4/18/2019 19:33,46.60,3.671000e+12,4,Rural
2371,West Heather,3/2/2019 21:04,20.99,5.766450e+12,4,Rural
2372,West Heather,3/6/2019 20:06,48.11,2.570550e+12,4,Rural
2373,West Heather,2/2/2019 6:28,53.07,2.462950e+12,4,Rural
2374,West Heather,5/7/2019 19:22,44.94,4.256850e+12,4,Rural

                    city             date   fare       ride_id
0     Lake Jonathanshire  1/14/2019 10:14  13.83  5.739410e+12
1     South Michelleport   3/4/2019 18:24  30.24  2.343910e+12
2     Port Samanthamouth   2/24/2019 4:29  33.44  2.005070e+12
3             Rodneyfort  2/10/2019 23:22  23.44  5.149250e+12
4             South Jack    3/6/2019 4:28  34.58  3.908450e+12
...                  ...              ...    ...           ...
2370         Michaelberg  4/29/2019 17:04  13.38  8.550370e+12
2371     Lake Latoyabury   1/30/2019 0:05  20.76  9.018730e+12
2372         North Jaime  2/10/2019 21:03  11.11  2.781340e+12
2373        West Heather   5/7/2019 19:22  44.94  4.256850e+12
2374          Newtonview  4/25/2019 10:20  55.84  9.990580e+12

[2375 rows x 4 columns]

city            2375
date            2375
fare            2375
ride_id         2375
driver_count    2375
type            2375
dtype: int64